In [12]:
import pandas as pd

df = pd.read_csv("../data/rental/apt_rental_price_clean1.csv")

print(df.shape)
df.head()

(2220, 83)

,city,state,bedroom_size,price_2014_01,price_2014_02,price_2014_03,price_2014_04,price_2014_05,price_2014_06,price_2014_07,...,price_2019_11,price_2019_12,price_2020_01,price_2020_02,price_2020_03,price_2020_04,price_2020_05,price_2020_06,price_2020_07,price_2020_08
0,New York,NY,Studio,1780,1778,1781,1786,1794,1802,1817,...,1940,1943,1939,1938,1939,1934,1923,1904,1886,1864
1,New York,NY,1br,1976,1975,1978,1983,1992,2001,2018,...,2155,2158,2153,2152,2153,2148,2135,2115,2094,2070
2,New York,NY,2br,2354,2352,2356,2362,2373,2384,2404,...,2567,2570,2565,2564,2565,2559,2543,2519,2494,2466
3,New York,NY,3br,3036,3033,3038,3046,3060,3074,3099,...,3310,3314,3307,3306,3308,3300,3279,3248,3216,3180
4,New York,NY,4br,3381,3378,3383,3392,3407,3424,3452,...,3686,3691,3684,3682,3684,3675,3652,3617,3582,3541

In [14]:
df.columns

Index(['city', 'state', 'bedroom_size', 'price_2014_01', 'price_2014_02',
       'price_2014_03', 'price_2014_04', 'price_2014_05', 'price_2014_06',
       'price_2014_07', 'price_2014_08', 'price_2014_09', 'price_2014_10',
       'price_2014_11', 'price_2014_12', 'price_2015_01', 'price_2015_02',
       'price_2015_03', 'price_2015_04', 'price_2015_05', 'price_2015_06',
       'price_2015_07', 'price_2015_08', 'price_2015_09', 'price_2015_10',
       'price_2015_11', 'price_2015_12', 'price_2016_01', 'price_2016_02',
       'price_2016_03', 'price_2016_04', 'price_2016_05', 'price_2016_06',
       'price_2016_07', 'price_2016_08', 'price_2016_09', 'price_2016_10',
       'price_2016_11', 'price_2016_12', 'price_2017_01', 'price_2017_02',
       'price_2017_03', 'price_2017_04', 'price_2017_05', 'price_2017_06',
       'price_2017_07', 'price_2017_08', 'price_2017_09', 'price_2017_10',
       'price_2017_11', 'price_2017_12', 'price_2018_01', 'price_2018_02',
       'price_2018_03', 'price_2018_04', 'price_2018_05', 'price_2018_06',
       'price_2018_07', 'price_2018_08', 'price_2018_09', 'price_2018_10',
       'price_2018_11', 'price_2018_12', 'price_2019_01', 'price_2019_02',
       'price_2019_03', 'price_2019_04', 'price_2019_05', 'price_2019_06',
       'price_2019_07', 'price_2019_08', 'price_2019_09', 'price_2019_10',
       'price_2019_11', 'price_2019_12', 'price_2020_01', 'price_2020_02',
       'price_2020_03', 'price_2020_04', 'price_2020_05', 'price_2020_06',
       'price_2020_07', 'price_2020_08'],
      dtype='object')

In [15]:
subset = df[df.city == "New York"]

print(subset.shape)
subset.head()

(5, 83)

,city,state,bedroom_size,price_2014_01,price_2014_02,price_2014_03,price_2014_04,price_2014_05,price_2014_06,price_2014_07,...,price_2019_11,price_2019_12,price_2020_01,price_2020_02,price_2020_03,price_2020_04,price_2020_05,price_2020_06,price_2020_07,price_2020_08
0,New York,NY,Studio,1780,1778,1781,1786,1794,1802,1817,...,1940,1943,1939,1938,1939,1934,1923,1904,1886,1864
1,New York,NY,1br,1976,1975,1978,1983,1992,2001,2018,...,2155,2158,2153,2152,2153,2148,2135,2115,2094,2070
2,New York,NY,2br,2354,2352,2356,2362,2373,2384,2404,...,2567,2570,2565,2564,2565,2559,2543,2519,2494,2466
3,New York,NY,3br,3036,3033,3038,3046,3060,3074,3099,...,3310,3314,3307,3306,3308,3300,3279,3248,3216,3180
4,New York,NY,4br,3381,3378,3383,3392,3407,3424,3452,...,3686,3691,3684,3682,3684,3675,3652,3617,3582,3541

In [30]:
transposed = subset.T
transposed

                      0         1         2         3         4
city           New York  New York  New York  New York  New York
state                NY        NY        NY        NY        NY
bedroom_size     Studio       1br       2br       3br       4br
price_2014_01      1780      1976      2354      3036      3381
price_2014_02      1778      1975      2352      3033      3378
...                 ...       ...       ...       ...       ...
price_2020_04      1934      2148      2559      3300      3675
price_2020_05      1923      2135      2543      3279      3652
price_2020_06      1904      2115      2519      3248      3617
price_2020_07      1886      2094      2494      3216      3582
price_2020_08      1864      2070      2466      3180      3541

[83 rows x 5 columns]

In [31]:
transposed.columns = transposed.loc["bedroom_size"].values
transposed.head()

                 Studio       1br       2br       3br       4br
city           New York  New York  New York  New York  New York
state                NY        NY        NY        NY        NY
bedroom_size     Studio       1br       2br       3br       4br
price_2014_01      1780      1976      2354      3036      3381
price_2014_02      1778      1975      2352      3033      3378

In [32]:
city = transposed["Studio"]["city"]
state = transposed["Studio"]["state"]

city, state

('New York', 'NY')

In [33]:
transposed.drop(["city", "state", "bedroom_size"], inplace=True)

print(transposed.shape)
transposed.head()

(80, 5)

              Studio   1br   2br   3br   4br
price_2014_01   1780  1976  2354  3036  3381
price_2014_02   1778  1975  2352  3033  3378
price_2014_03   1781  1978  2356  3038  3383
price_2014_04   1786  1983  2362  3046  3392
price_2014_05   1794  1992  2373  3060  3407

In [34]:
transposed.tail()

              Studio   1br   2br   3br   4br
price_2020_04   1934  2148  2559  3300  3675
price_2020_05   1923  2135  2543  3279  3652
price_2020_06   1904  2115  2519  3248  3617
price_2020_07   1886  2094  2494  3216  3582
price_2020_08   1864  2070  2466  3180  3541

In [36]:
transposed.dtypes

Studio    object
1br       object
2br       object
3br       object
4br       object
dtype: object

In [38]:
type(transposed.Studio.price_2014_01), transposed.Studio.price_2014_01

(int, 1780)

In [40]:
for col in transposed.columns:
    print(f"{col}: {transposed[col].isna().sum()}")

Studio: 0
1br: 0
2br: 0
3br: 0
4br: 0

In [42]:
transposed.index

Index(['price_2014_01', 'price_2014_02', 'price_2014_03', 'price_2014_04',
       'price_2014_05', 'price_2014_06', 'price_2014_07', 'price_2014_08',
       'price_2014_09', 'price_2014_10', 'price_2014_11', 'price_2014_12',
       'price_2015_01', 'price_2015_02', 'price_2015_03', 'price_2015_04',
       'price_2015_05', 'price_2015_06', 'price_2015_07', 'price_2015_08',
       'price_2015_09', 'price_2015_10', 'price_2015_11', 'price_2015_12',
       'price_2016_01', 'price_2016_02', 'price_2016_03', 'price_2016_04',
       'price_2016_05', 'price_2016_06', 'price_2016_07', 'price_2016_08',
       'price_2016_09', 'price_2016_10', 'price_2016_11', 'price_2016_12',
       'price_2017_01', 'price_2017_02', 'price_2017_03', 'price_2017_04',
       'price_2017_05', 'price_2017_06', 'price_2017_07', 'price_2017_08',
       'price_2017_09', 'price_2017_10', 'price_2017_11', 'price_2017_12',
       'price_2018_01', 'price_2018_02', 'price_2018_03', 'price_2018_04',
       'price_2018_05', 'price_2018_06', 'price_2018_07', 'price_2018_08',
       'price_2018_09', 'price_2018_10', 'price_2018_11', 'price_2018_12',
       'price_2019_01', 'price_2019_02', 'price_2019_03', 'price_2019_04',
       'price_2019_05', 'price_2019_06', 'price_2019_07', 'price_2019_08',
       'price_2019_09', 'price_2019_10', 'price_2019_11', 'price_2019_12',
       'price_2020_01', 'price_2020_02', 'price_2020_03', 'price_2020_04',
       'price_2020_05', 'price_2020_06', 'price_2020_07', 'price_2020_08'],
      dtype='object')

In [45]:
transposed.index = pd.to_datetime(transposed.index, format="price_%Y_%m")
transposed.index.freq = "MS"

transposed.index

DatetimeIndex(['2014-01-01', '2014-02-01', '2014-03-01', '2014-04-01',
               '2014-05-01', '2014-06-01', '2014-07-01', '2014-08-01',
               '2014-09-01', '2014-10-01', '2014-11-01', '2014-12-01',
               '2015-01-01', '2015-02-01', '2015-03-01', '2015-04-01',
               '2015-05-01', '2015-06-01', '2015-07-01', '2015-08-01',
               '2015-09-01', '2015-10-01', '2015-11-01', '2015-12-01',
               '2016-01-01', '2016-02-01', '2016-03-01', '2016-04-01',
               '2016-05-01', '2016-06-01', '2016-07-01', '2016-08-01',
               '2016-09-01', '2016-10-01', '2016-11-01', '2016-12-01',
               '2017-01-01', '2017-02-01', '2017-03-01', '2017-04-01',
               '2017-05-01', '2017-06-01', '2017-07-01', '2017-08-01',
               '2017-09-01', '2017-10-01', '2017-11-01', '2017-12-01',
               '2018-01-01', '2018-02-01', '2018-03-01', '2018-04-01',
               '2018-05-01', '2018-06-01', '2018-07-01', '2018-08-01',
               '2018-09-01', '2018-10-01', '2018-11-01', '2018-12-01',
               '2019-01-01', '2019-02-01', '2019-03-01', '2019-04-01',
               '2019-05-01', '2019-06-01', '2019-07-01', '2019-08-01',
               '2019-09-01', '2019-10-01', '2019-11-01', '2019-12-01',
               '2020-01-01', '2020-02-01', '2020-03-01', '2020-04-01',
               '2020-05-01', '2020-06-01', '2020-07-01', '2020-08-01'],
              dtype='datetime64[ns]', freq='MS')

In [46]:
transposed.head()

           Studio   1br   2br   3br   4br
2014-01-01   1780  1976  2354  3036  3381
2014-02-01   1778  1975  2352  3033  3378
2014-03-01   1781  1978  2356  3038  3383
2014-04-01   1786  1983  2362  3046  3392
2014-05-01   1794  1992  2373  3060  3407

In [48]:
transposed.to_csv("../data/rental/rental.csv")